{
  "cosmic_discovery": {
    "default_username": "Gezgin",
    "sign_analysis": "{sign} Burcu Analizi",
    "discover": "Kesfet",
    "detailed_analysis": "Detayli Analiz",
    "advice": "Tavsiye",
    "share_on_instagram": "Bu kesfi Instagram'da paylas!",
    "share": "Paylas",
    "share_coming_soon": "Paylasim ozelligi cok yakinda!",
    "content_loading": "Icerik yukleniyor...",
    "shadow_discovering": "Golge benligin kesfediliyor...",
    "details_loading": "Detaylar yukleniyor...",
    "advice_preparing": "Tavsiyeler hazirlaniyor...",
    "warning_suppress": "Dikkat: Golgeni bastirmak onu guclendirir. Onu kabul et ve donustur.",

    "shadow_self": {
      "aries": {
        "main": "{name}, senin golge benligin sabirsizlik ve ofke kontrolu ile ilgili. Koc burcu olarak hizli hareket etme istegin bazen seni durtusal kararlara surukleyebilir. Golgen, baskalrini geride birakma korkusundan besleniyor.",
        "details": "Golge Koc: Asiri rekabetcilik, baskalarinin fikirlerini dinlememe, 'ben bilirim' tutumu, sabirsizliktan kaynaklanan yarim birakilmis projeler. Ofke patlamalari ve sonra pismanlik dongusu.",
        "advice": "Golgenle yuzlesmek icin: Bir sey yapmadan once 10 saniye bekle. Baskalarinin da hakli olabilecegini kabul et. Rekabeti is birligine donustur.",
        "warning": "Dikkat: Golgeni bastirmak onu guclendirir. Onu kabul et ve donustur."
      },
      "taurus": {
        "main": "{name}, senin golge benligin inatcilik ve maddi bagimlilik ile ilgili. Boga burcu olarak guvenlik arayisin bazen seni degisime direncli yapabilir. Golgen, kaybetme korkusundan besleniyor.",
        "details": "Golge Boga: Asiri sahiplenme, degisime direnc, konfor alaninda sikisip kalma, maddi guvenligi duygusal guvenligin onune koyma. Tembellik ve erteleme egilimi.",
        "advice": "Golgenle yuzlesmek icin: Kucuk degisikliklerle basla. 'Sahip olduklarim ben degilim' mantrasi. Bazen kayip, kazanctir.",
        "warning": "Dikkat: Asiri guvenlik arayisi seni hayattan koparabilir."
      },
      "gemini": {
        "main": "{name}, senin golge benligin tutarsizlik ve yuzeysellik ile ilgili. Ikizler burcu olarak merakin bazen seni dagitabilir. Golgen, derinlesme korkusundan besleniyor.",
        "details": "Golge Ikizler: Sozunde durmama, ilgi daginikligi, dedikodu yapma egilimi, duygusal derinlikten kacinma. Iki yuzluluk algisi yaratma.",
        "advice": "Golgenle yuzlesmek icin: Bir konuya odaklan ve derinles. Verdigin sozleri yaz ve takip et. Sessizligin gucunu kesfet.",
        "warning": "Dikkat: Surekli kacis, hicbir yere varmamana neden olur."
      },
      "cancer": {
        "main": "{name}, senin golge benligin asiri hassasiyet ve manipulasyon ile ilgili. Yengec burcu olarak koruyuculugun bazen bogucu olabilir. Golgen, reddedilme korkusundan besleniyor.",
        "details": "Golge Yengec: Duygusal manipulasyon, gecmise takilip kalma, pasif agresif davranislar, 'kurban' rolu oynama. Asiri korumacilik ve kontrol.",
        "advice": "Golgenle yuzlesmek icin: Duygularini dogrudan ifade et. Gecmisi birak, simdiyi yasa. Sevdiklerini ozgur birak.",
        "warning": "Dikkat: Kabuguna cekilmek problemi cozmez, sadece erteler."
      },
      "leo": {
        "main": "{name}, senin golge benligin ego ve onay bagimliligi ile ilgili. Aslan burcu olarak parildama istegin bazen baskalarini golgede birakabilir. Golgen, gorunmez olma korkusundan besleniyor.",
        "details": "Golge Aslan: Asiri ego, surekli ilgi beklentisi, elestiriyi kaldiramama, baskalarinin basarisini kiskanma. Drama yaratma egilimi.",
        "advice": "Golgenle yuzlesmek icin: Baskalarini ov ve onlarin parlamasina izin ver. Kendi degerini icsel kaynaklardan bul. Tevazu pratigi yap.",
        "warning": "Dikkat: Disaridan onay, icerideki bosluqu doldurmaz."
      },
      "virgo": {
        "main": "{name}, senin golge benligin mukemmeliyetcilik ve elestiri ile ilgili. Basak burcu olarak detayciligin bazen felc edici olabilir. Golgen, yetersizlik korkusundan besleniyor.",
        "details": "Golge Basak: Asiri elestiri (kendine ve baskalarina), hicbir seyin yeterli olmadigi hissi, kaygi ve endise, 'paralysis by analysis'. Baskalrini kucumseme.",
        "advice": "Golgenle yuzlesmek icin: 'Yeterince iyi' kavramini ogren. Hatalari ogrenme firsati olarak gor. Kendine sefkat goster.",
        "warning": "Dikkat: Mukemmellik arayisi, hicbir sey yapmamakla sonuclanabilir."
      },
      "libra": {
        "main": "{name}, senin golge benligin kararsizlik ve catismadan kacinma ile ilgili. Terazi burcu olarak uyum arayisin bazen seni kendi ihtiyaclarindan uzaklastirabilir. Golgen, yalniz kalma korkusundan besleniyor.",
        "details": "Golge Terazi: Herkesi memnun etme cabasi, kendi fikrini soyleyememe, pasif agresiflik, yuzeysel iliskiler. Kararlarini baskalarina birakma.",
        "advice": "Golgenle yuzlesmek icin: 'Hayir' demeyi ogren. Kendi fikrini savun. Saglikli catisma kacinilmazdir ve gereklidir.",
        "warning": "Dikkat: Herkesi mutlu etmeye calismak, en cok kendini mutsuz eder."
      },
      "scorpio": {
        "main": "{name}, senin golge benligin kontrol ve intikam ile ilgili. Akrep burcu olarak yogunlugun bazen zehirli olabilir. Golgen, guc kaybetme korkusundan besleniyor.",
        "details": "Golge Akrep: Asiri kiskanclik ve sahiplenme, manipulasyon, intikam dusunceleri, guvensizlik. Gizlilik takintisi ve paranoya.",
        "advice": "Golgenle yuzlesmek icin: Kontrolu birakmayi ogren. Affetmenin gucunu kesfet. Guven insa etmek icin acil.",
        "warning": "Dikkat: Intikam seni karsindakinden cok kendini yakar."
      },
      "sagittarius": {
        "main": "{name}, senin golge benligin sorumsuzluk ve taahhtten kacinma ile ilgili. Yay burcu olarak ozgurluk askin bazen kacis olabilir. Golgen, sikisip kalma korkusundan besleniyor.",
        "details": "Golge Yay: Taahht fobisi, asiri iyimserlikle gerceklerden kacis, sozunde durmama, sorumluluktan kacinma. Dusuncesiz sozler.",
        "advice": "Golgenle yuzlesmek icin: Ozgurluk ve bagliligin bir arada olabilecegini ogren. Sozlerinin etkisini dusun. Kacmak yerine yuzles.",
        "warning": "Dikkat: Surekli kacis, hicbir yere ait olmamakla sonuclanir."
      },
      "capricorn": {
        "main": "{name}, senin golge benligin is bagimliligi ve duygusal mesafe ile ilgili. Oglak burcu olarak hirsin bazen seni insanliktan uzaklastirabilir. Golgen, basarisizlik korkusundan besleniyor.",
        "details": "Golge Oglak: Workaholism, duygusal sogukluk, statu takintisi, baskalrini arac olarak gorme. Pesimizm ve umutsuzluk.",
        "advice": "Golgenle yuzlesmek icin: Is-yasam dengesi kur. Duygularini ifade et. Basari tanimini genislet.",
        "warning": "Dikkat: Zirveye ulastiginda yaninda kimse olmayabilir."
      },
      "aquarius": {
        "main": "{name}, senin golge benligin duygusal mesafe ve ustunluk kompleksi ile ilgili. Kova burcu olarak farkliligin bazen yalnizliga donusebilir. Golgen, siradan olma korkusundan besleniyor.",
        "details": "Golge Kova: Duygusal kopukluk, 'ben herkesin otesindeyim' tutumu, empati eksikligi, yakin iliskilerden kacinma. Asi pose.",
        "advice": "Golgenle yuzlesmek icin: Farkli olmak icin farkli olma. Duygusal baglanti kur. Insanligin bir parcasi oldugunu hatirla.",
        "warning": "Dikkat: Herkesin otesinde olmak, hic kimseyle birlikte olmamak demek."
      },
      "pisces": {
        "main": "{name}, senin golge benligin kacis ve kurban zihniyeti ile ilgili. Balik burcu olarak hassasiyetin bazen seni gerceklikten koparabilir. Golgen, aci cekme korkusundan besleniyor.",
        "details": "Golge Balik: Bagimlilik egilimleri (madde, iliski, fantezi), kurban rolu, sinir koyamama, gerceklikten kacis. Aldatici olma veya aldanma.",
        "advice": "Golgenle yuzlesmek icin: Saglikli sinirlar koy. Kacis yerine yuzlesmeyi sec. Hayal ile gercegi ayir.",
        "warning": "Dikkat: Gerceklikten surekli kacis, daha buyuk acilara yol acar."
      }
    },

    "red_flags": {
      "intro": "{name}, iste senin Red Flag'lerin! {sign} burcu olarak bu davranislarin farkinda olmak onemli.",
      "aries": {
        "main": "{name}, iste senin Red Flag'lerin! Koc burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Sabirsizlik ve ani ofke patlamalari\nBaskalarinin fikirlerini dinlemeden karar verme\n'Benim yolum ya da hic' tutumu\nHizli sikilma ve yarim birakma\nEgo catismalarinda geri adim atmama\nDusunmeden hareket etme",
        "advice": "Bunlari fark ettiginde: Dur, nefes al, 10'a kadar say. Baskalarinin da hakli olabilecegini dusun."
      },
      "taurus": {
        "main": "{name}, iste senin Red Flag'lerin! Boga burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Asiri inatcilik ve degisime direnc\nSahiplenicilik ve kiskanclik\nMaddi guvenligi her seyin onune koyma\nKonfor alanindan cikmayi reddetme\nTembellik ve erteleme\nIntikamci olabilme",
        "advice": "Bunlari fark ettiginde: Degisimin buyume oldugunu hatirla. Sahip olduklarin seni tanimlamaz."
      },
      "gemini": {
        "main": "{name}, iste senin Red Flag'lerin! Ikizler burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Tutarsizlik ve sozunde durmama\nDedikodu yapma egilimi\nYuzeysellik ve derinlesememe\nIki yuzluluk algisi\nSurekli dikkat daginikligi\nDuygusal baglanmaktan kacinma",
        "advice": "Bunlari fark ettiginde: Bir konuya odaklan. Verdigin sozleri not al ve tut."
      },
      "cancer": {
        "main": "{name}, iste senin Red Flag'lerin! Yengec burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Duygusal manipulasyon\nPasif agresif davranislar\nGecmise takilip kalma\nAsiri hassasiyet ve alinganlik\nKabuguna cekilme ve iletisimi kesme\nSucluluk duygusu yaratma",
        "advice": "Bunlari fark ettiginde: Duygularini dogrudan ifade et. Gecmis gecmiste kaldi."
      },
      "leo": {
        "main": "{name}, iste senin Red Flag'lerin! Aslan burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Asiri ego ve kendini begenmislik\nSurekli ilgi ve ovgu beklentisi\nElestiriyi hic kaldiramama\nDrama yaratma\nBaskalarinin parlamasini kiskanma\nHer seyin merkezinde olma istegi",
        "advice": "Bunlari fark ettiginde: Baskalrini da ov. Alcakgonulluluk kralligi zayiflatmaz, guclendirir."
      },
      "virgo": {
        "main": "{name}, iste senin Red Flag'lerin! Basak burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Asiri elestiri (kendine ve baskalarina)\nMukemmeliyetcilik takintisi\nKucuk detaylara takilip buyuk resmi kacirma\nSurekli kaygi ve endise\nBaskalrini kucumseme\nHicbir seyin yeterli olmamasi",
        "advice": "Bunlari fark ettiginde: 'Yeterince iyi' yeterlidir. Kendine sefkat goster."
      },
      "libra": {
        "main": "{name}, iste senin Red Flag'lerin! Terazi burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Asiri kararsizlik\nHerkesi memnun etme cabasi\nCatismadan kacinma\nKendi fikrini soyleyememe\nYuzeysel iliskiler kurma\nPasif agresif davranislar",
        "advice": "Bunlari fark ettiginde: Kendi sesini bul. Hayir demek sevgi kaybi degildir."
      },
      "scorpio": {
        "main": "{name}, iste senin Red Flag'lerin! Akrep burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Asiri kiskanclik ve sahiplenme\nIntikam dusunceleri\nManipulasyon\nGuvensizlik ve paranoya\nHer seyi kontrol etme istegi\nAffetmekte zorlanma",
        "advice": "Bunlari fark ettiginde: Kontrolu birak. Affetmek gucsuzluk degil, guctur."
      },
      "sagittarius": {
        "main": "{name}, iste senin Red Flag'lerin! Yay burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Taahht fobisi\nSorumsuzluk\nDusuncesiz ve kirici sozler\nVaatlerini tutmama\nGerceklerden kacis\nSurekli 'daha iyi bir sey var' dusuncesi",
        "advice": "Bunlari fark ettiginde: Sozlerinin agirligini hisset. Bazen en buyuk macera, kalmaktir."
      },
      "capricorn": {
        "main": "{name}, iste senin Red Flag'lerin! Oglak burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Is bagimliligi\nDuygusal sogukluk ve mesafe\nStatu takintisi\nInsanlari arac olarak gorme\nAsiri pesimizm\nHayati sadece basariyla olcme",
        "advice": "Bunlari fark ettiginde: Iliskiler de yatirimdir. Basari, sevdiklerinle paylasilmazsa bostur."
      },
      "aquarius": {
        "main": "{name}, iste senin Red Flag'lerin! Kova burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Duygusal kopukluk\nUstunluk kompleksi\nEmpati eksikligi\nYakin iliskilerden kacinma\n'Kimse beni anlamiyor' tutumu\nSirf farkli olmak icin farkli olma",
        "advice": "Bunlari fark ettiginde: Farkli olmak seni daha iyi yapmaz. Baglanti kurmak guctur."
      },
      "pisces": {
        "main": "{name}, iste senin Red Flag'lerin! Balik burcu olarak bu davranislarin farkinda olmak onemli.",
        "details": "Kurban zihniyeti\nGerceklikten kacis\nBagimlilik egilimleri\nSinir koyamama\nAsiri fedarkarlik ve sonra sikayet\nHayal ile gercegi karistirma",
        "advice": "Bunlari fark ettiginde: Sinirlar sevginin dusmani degil, koruyucusudur."
      }
    },

    "green_flags": {
      "intro": "{name}, iste senin Green Flag'lerin! {sign} burcu olarak bu harika ozelliklerinle gurur duy.",
      "trait_unique": "Bu ozeliklerin seni benzersiz kiliyor.",
      "aries": {
        "main": "{name}, iste senin Green Flag'lerin! Koc burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Cesaret ve girisimcilik\nLiderlik yetenegi\nDurustluk ve acik sozluluk\nEnerji ve cosku\nKoruyuculuk\nHayata atilma cesareti",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Cesaretini baskalarina ilham vermek icin kullan."
      },
      "taurus": {
        "main": "{name}, iste senin Green Flag'lerin! Boga burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Sadakat ve guvenilirlik\nSabir ve kararlilik\nPratik zeka\nDuyusal zevkleri takdir etme\nFinansal akil\nSakin ve topraklanmis enerji",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Sadakatin en degerli hediyedir."
      },
      "gemini": {
        "main": "{name}, iste senin Green Flag'lerin! Ikizler burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Zeka ve merak\nIletisim yetenegi\nUyum saglama\nEglenceli ve esprituel\nCok yonluluk\nSosyal beceriler",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Iletisim gucunle koprular kur."
      },
      "cancer": {
        "main": "{name}, iste senin Green Flag'lerin! Yengec burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Sefkat ve empati\nKoruyuculuk\nDuygusal zeka\nSezgisel guc\nYuva kurma yetenegi\nSadakat",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Sefkatin dunyayi degistirir."
      },
      "leo": {
        "main": "{name}, iste senin Green Flag'lerin! Aslan burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Comertlik\nYaraticilik\nSicaklik ve nese\nLiderlik\nSadakat\nIlham verme yetenegi",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Parildaman baskalrini da aydinlatir."
      },
      "virgo": {
        "main": "{name}, iste senin Green Flag'lerin! Basak burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Yardimseverlik\nGuvenilirlik\nAnalitik zeka\nPratik cozumler\nDetaylara dikkat\nAlcakgonulluluk",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Hizmet etme ruhun en saf sevgi bicimi."
      },
      "libra": {
        "main": "{name}, iste senin Green Flag'lerin! Terazi burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Diplomasi ve adalet duygusu\nEstetik anlayis\nUyum saglama\nRomantizm\nIs birligi yetenegi\nNaziklik",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Bariscil dogan dunyayi iyilestirir."
      },
      "scorpio": {
        "main": "{name}, iste senin Green Flag'lerin! Akrep burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Derin sadakat\nTutku ve yogunluk\nSezgisel guc\nDonusum kapasitesi\nKoruyuculuk\nCesaret",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Yogunlugun en derin baglari kurar."
      },
      "sagittarius": {
        "main": "{name}, iste senin Green Flag'lerin! Yay burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Iyimserlik\nMacera ruhu\nDurustluk\nFelsefi derinlik\nComertlik\nEglenceli enerji",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Iyimserligin baskalarina umut verir."
      },
      "capricorn": {
        "main": "{name}, iste senin Green Flag'lerin! Oglak burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Guvenilirlik\nSorumluluk\nAzim ve kararlilik\nPratik zeka\nKoruyuculuk\nUzun vadeli dusunme",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Kararliligin daglari bile yerinden oynatir."
      },
      "aquarius": {
        "main": "{name}, iste senin Green Flag'lerin! Kova burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Ozgunluk\nInsancillik\nYenilikcilik\nBagimsiz dusunce\nArkadaslik degeri\nVizyonerlik",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Benzersiz bakis acin dunyayi degistirir."
      },
      "pisces": {
        "main": "{name}, iste senin Green Flag'lerin! Balik burcu olarak bu harika ozelliklerinle gurur duy.",
        "details": "Empati ve sefkat\nYaraticilik\nSezgisel guc\nRomantizm\nFedakarlik\nSpiritual derinlik",
        "advice": "Bu ozeliklerin seni benzersiz kiliyor. Empatin dunyayi iyilestirir."
      }
    },

    "life_purpose": {
      "aries": {
        "main": "{name}, senin hayat amacin yeni yollar acmak ve cesaretle liderlik etmek. Koc burcu olarak oncu olmak icin dogun.",
        "details": "Hayat Misyonun: Insanlara cesareti ogretmek, yeni baslangiclar yapmak, korkulari yenmek icin ilham vermek. Sen bir atesliyicisin - durgun enerjileri harekete gecirirsin.",
        "advice": "Amacini yasamak icin: Korkulrinla yuzles, risk al, baskalarina cesaret ver. Liderlik pozisyonlarinda en iyi halinle parla."
      },
      "taurus": {
        "main": "{name}, senin hayat amacin guzellik yaratmak ve guvenli temeller kurmak. Boga burcu olarak bolluk getirmek icin dogun.",
        "details": "Hayat Misyonun: Maddi ve manevi bolluk yaratmak, guzelligi dunyaya getirmek, guvenli alanlar insa etmek. Sen bir insacisin - kalici degerler yaratirsin.",
        "advice": "Amacini yasamak icin: Guzel seyler yarat, deger uret, baskalarina guvenlik his ettir. Dogayla baglantianda kalarak en iyi halinle parla."
      },
      "gemini": {
        "main": "{name}, senin hayat amacin bilgiyi yaymak ve baglantilar kurmak. Ikizler burcu olarak iletisim icin dogun.",
        "details": "Hayat Misyonun: Fikirleri paylasmak, insanlari birbirine baglamak, meraki uyandirmak. Sen bir elcisin - bilgiyi tasir ve donustururuun.",
        "advice": "Amacini yasamak icin: Ogren ve ogret, koprular kur, fikirleri yay. Iletisim alanlarinda en iyi halinle parla."
      },
      "cancer": {
        "main": "{name}, senin hayat amacin beslemek ve duygusal guvenlik saglamak. Yengec burcu olarak sefkat icin dogun.",
        "details": "Hayat Misyonun: Duygusal destek vermek, guvenli alanlar yaratmak, besleme ve iyilestirme. Sen bir bakicisin - ruhlari iyiestirirsin.",
        "advice": "Amacini yasamak icin: Sefkatini paylas, yuva kur, baskalrini koru. Bakim veren rollerde en iyi halinle parla."
      },
      "leo": {
        "main": "{name}, senin hayat amacin parlamak ve baskalarina ilham vermek. Aslan burcu olarak yaraticilik icin dogun.",
        "details": "Hayat Misyonun: Yaratici ifade, ilham verme, comertlik ve nese yayma. Sen bir gunessin - etrafindakileri aydinlatirsin.",
        "advice": "Amacini yasamak icin: Yarat, ilham ver, comert ol. Sahne onu ve yaratici alanlarda en iyi halinle parla."
      },
      "virgo": {
        "main": "{name}, senin hayat amacin hizmet etmek ve mukemmellestirmek. Basak burcu olarak iyilestirme icin dogun.",
        "details": "Hayat Misyonun: Pratik yollarla yardim etmek, sistemleri iyilestirmek, sifa getirmek. Sen bir iyilestiricisin - her seyi daha iyi hale getirirsin.",
        "advice": "Amacini yasamak icin: Hizmet et, duzeni kur, sifa sun. Saglik ve organizasyon alanlarinda en iyi halinle parla."
      },
      "libra": {
        "main": "{name}, senin hayat amacin denge ve guzellik yaratmak. Terazi burcu olarak uyum icin dogun.",
        "details": "Hayat Misyonun: Adalet saglamak, guzellik yaratmak, baris getirmek. Sen bir arabulucusun - zitliklari dengelersin.",
        "advice": "Amacini yasamak icin: Koprular kur, guzellik yarat, adalet sagla. Sanat ve diplomasi alanlarinda en iyi halinle parla."
      },
      "scorpio": {
        "main": "{name}, senin hayat amacin donusturmek ve derinlere inmek. Akrep burcu olarak sifa icin dogun.",
        "details": "Hayat Misyonun: Donusumu kolaylastirmak, gizli gercekleri ortaya cikarmak, derin sifa. Sen bir simyacisin - kursunu altina cevirirsin.",
        "advice": "Amacini yasamak icin: Derinlere dal, donustur, sifa sun. Psikoloji ve arastirma alanlarinda en iyi halinle parla."
      },
      "sagittarius": {
        "main": "{name}, senin hayat amacin kesfetmek ve bilgelik paylasmak. Yay burcu olarak ogretmek icin dogun.",
        "details": "Hayat Misyonun: Ufuklari genisletmek, bilgelik aramak ve paylasmak, ozgurluk ruhunu yaymak. Sen bir ogretmensin - hayatin anlamini arasirsin.",
        "advice": "Amacini yasamak icin: Kesfet, ogret, ilham ver. Egitim ve seyahat alanlarinda en iyi halinle parla."
      },
      "capricorn": {
        "main": "{name}, senin hayat amacin insa etmek ve miras birakmak. Oglak burcu olarak basarmak icin dogun.",
        "details": "Hayat Misyonun: Kalici yapilar kurmak, sorumluluk almak, miras birakmak. Sen bir mimarsin - nesillere kalacak eserler yaratirsin.",
        "advice": "Amacini yasamak icin: Hedefler koy, insa et, miras birak. Is ve yonetim alanlarinda en iyi halinle parla."
      },
      "aquarius": {
        "main": "{name}, senin hayat amacin yenilik getirmek ve insanliga hizmet etmek. Kova burcu olarak devrim icin dogun.",
        "details": "Hayat Misyonun: Yeni fikirler getirmek, sosyal degisim yaratmak, gelecegi sekillendirmek. Sen bir vizyonersin - yarini bugun gorursun.",
        "advice": "Amacini yasamak icin: Yenile, birlestir, degistir. Teknoloji ve sosyal alanlarinda en iyi halinle parla."
      },
      "pisces": {
        "main": "{name}, senin hayat amacin ruhani baglanti kurmak ve sefkat yaymak. Balik burcu olarak iyilestirmek icin dogun.",
        "details": "Hayat Misyonun: Spiritual baglanti saglamak, sanatla ifade etmek, kosulsuz sevgiyi yaymak. Sen bir mistiksin - gorunmeyeni gorursun.",
        "advice": "Amacini yasamak icin: Baglan, yarat, sifa sun. Sanat ve spiritual alanlarda en iyi halinle parla."
      }
    },

    "karma_lessons": {
      "main": "{name}, {sign} burcu olarak karma derslerini ogrenme zamani geldi. Guney Dugumu gecmis yasam aliskanliklarini, Saturn ise bu hayattaki sinavlarini temsil eder. Bu hayatta uzerinde calisman gereken temalar var.",
      "details_intro": "Karma Dongun:",
      "details_template": "Karma derslerin burc elementine ve yonetici gezegenine bagli olarak belirlenir. {element} elementi olarak {lesson} ogrenmen gerekiyor.",
      "soul_contract_lessons": "Ruh Sozlesmendeki Dersler:",
      "saturn_lessons": "Saturn'un evindeki dersler: Sorumluluk ve olgunlasma",
      "chiron_wounds": "Kiron'un gosterdigi yaralar: Sifa potansiyeli",
      "north_node": "Kuzey Dugumu: Ruhsal evrim yonun",
      "karma_timeline": "Karma Takvimi:",
      "karma_timeline_desc": "Saturn donusu (yaklasik 29 yas) ve Kiron donusu (yaklasik 50 yas) buyuk karma hesaplasma donemleridir.",
      "advice": "Her karsilastigin zorluk bir karma dersidir. Onu tani, kabul et ve donustur. Transit haritani takip ederek aktif karma donemlerini onceden bilebilirsin.",
      "warning": "Dikkat: Ayni dersler tekrar tekrar onune geliyorsa, henuz ogrenmedigin anlamina gelir. Kacmak yerine yuzles.",
      "fire_lesson": "sabir, alcakgonulluluk ve baskalrini dusunme",
      "earth_lesson": "birakma, guvenme ve degisime acik olma",
      "air_lesson": "derinlesme, tutarlilik ve duygusal baglanma",
      "water_lesson": "sinir koyma, gercekcilik ve duygusal bagimsizlik"
    },

    "soul_contract": {
      "main": "{name}, bu dunyaya gelmeden once ruhun bir sozlesme yapti. {sign} burcu olarak dogum haritandaki Kuzey Dugumu, Saturn ve 12. ev bu sozlesmenin izlerini tasiyor.",
      "contract_items": "Ruh Sozlesmenin Ana Maddeleri:",
      "contract_intro": "Ruh sozlesmen, yasam amacini, karma derslerini ve bu hayatta karsilasacagin temel deneyimleri iceriyor. {sign} olarak {theme} uzerine calismak icin geldin.",
      "contract_details": "Sozlesme Detaylari:",
      "life_purpose": "Yasam Amaci: Kuzey Dugumu'nun gosterdigi yon",
      "past_life_legacy": "Gecmis Yasam Mirasi: Guney Dugumu ve 12. ev",
      "healing_mission": "Sifa Gorevi: Kiron'un konumu",
      "maturation_areas": "Olgunlasma Alanlari: Saturn'un evi",
      "soul_connections": "Ruh Baglantilari:",
      "soul_connections_desc": "Hayatina giren onemli kisiler de ruh sozlesmenin parcasi. Sinastri haritasindaki Ay Dugumleri baglantilari, karmik ruh baglarini gosterir.",
      "advice": "Ruh sozlesmeni hatirlamak icin: Meditasyon yap, ruyalarina dikkat et, tekrarlayan temalari gozlemle. Dogum haritandaki 12. ev ve Neptun konumu, bilincalti hafizana erisim kapilarini gosterir.",
      "warning": "Ruh sozlesmesi degistirilemez degildir. Ozgur iradenle her an yeni secimler yapabilirsin.",
      "themes": {
        "aries": "cesaret ve liderlik",
        "taurus": "deger ve bolluk",
        "gemini": "iletisim ve ogrenme",
        "cancer": "sefkat ve aile",
        "leo": "yaraticilik ve kendini ifade",
        "virgo": "hizmet ve iyilestirme",
        "libra": "iliskiler ve denge",
        "scorpio": "donusum ve guc",
        "sagittarius": "ozgurluk ve bilgelik",
        "capricorn": "basari ve miras",
        "aquarius": "yenilik ve insanlik",
        "pisces": "spiritualite ve sifa"
      }
    },

    "inner_power": {
      "main": "{name}, icindeki guc fark ettiginden cok daha buyuk. {sign} burcu olarak benzersiz super guclerin var.",
      "details_intro": "Super Guclerin:",
      "advice": "Icsel gucunu aktive etmek icin: Guclu yonlerine odaklan, onlari bilincli kullan, her gun pratik yap.",
      "powers": {
        "aries": {
          "power1": "Cesaret Kalkani - Hicbir seyden korkmama",
          "power2": "Hiz Patlamasi - Ani aksiyon alma",
          "power3": "Koruyucu Icgudu - Sevdiklerini savunma"
        },
        "taurus": {
          "power1": "Bolluk Miknatisi - Maddi bereket cekme",
          "power2": "Sakinlik Kalesi - Strese dayaniklilik",
          "power3": "Dokunus Buyusu - Duyusal sifa"
        },
        "gemini": {
          "power1": "Zihin Okuma - Iletisimde ustunluk",
          "power2": "Adaptasyon - Her duruma uyum",
          "power3": "Bilgi Deposu - Her konuda bilgi"
        },
        "cancer": {
          "power1": "Empati Gucu - Duygulari hissetme",
          "power2": "Sifa Enerjisi - Baskalrini iyilestirme",
          "power3": "Sezgisel Rehberlik - Dogru yolu hissetme"
        },
        "leo": {
          "power1": "Karizmatik Aura - Dogal cekim gucu",
          "power2": "Ilham Verme - Baskalrini motive etme",
          "power3": "Comertlik Kalbi - Sinirsiz verme"
        },
        "virgo": {
          "power1": "Detay Gorusu - Hicbir seyi kacirmama",
          "power2": "Problem Cozme - Her soruna cozum bulma",
          "power3": "Mukemmellestirme - Her seyi iyilestirme"
        },
        "libra": {
          "power1": "Uyum Yaratma - Her ortama uyum saglama",
          "power2": "Diplomasi - Catismalari cozme",
          "power3": "Estetik Goz - Guzelligi gorme ve yaratma"
        },
        "scorpio": {
          "power1": "Donusum Gucu - Karanliktan guc alma",
          "power2": "Sezgi Radari - Yalan algilama",
          "power3": "Yeniden Dogus - Her dususten guclu kalkma"
        },
        "sagittarius": {
          "power1": "Sans Yildizi - Dogal sansli olma",
          "power2": "Ozgurluk Arayisi - Sinirlari asma",
          "power3": "Bilgelik Arayisi - Hayatin anlamini bulma"
        },
        "capricorn": {
          "power1": "Azim Duvari - Asla pes etmeme",
          "power2": "Stratejik Zeka - Uzun vadeli planlama",
          "power3": "Miras Yaratma - Kalici eserler birakma"
        },
        "aquarius": {
          "power1": "Vizyon Gozu - Gelecegi gorme",
          "power2": "Yenilikcilik - Benzersiz fikirler uretme",
          "power3": "Topluluk Kurma - Insanlari birlestirme"
        },
        "pisces": {
          "power1": "Ruhsal Baglanti - Evrenle iletisim",
          "power2": "Yaratici Deha - Sanatsal yetenek",
          "power3": "Ruya Izi - Bilincalti mesajlari anlama"
        }
      }
    },

    "loading": "Yukleniyor..."
  }
}
